
--Створіть наступні запити для бази даних з оцінками 
--студентів із попереднього практичного завдання:


--■ Показати інформацію про студентів з віком, у вказаному діапазоні.



select * from Students
--■ Показати ПІБ усіх студентів з мінімальною оцінкою 
--у вказаному діапазоні. 

select [fio] from Students
where [average_mark] between 80 and 90


--■ Показати інформацію про студентів, яким виповнилося 20 років.

select [fio] from Students
where [birthdate] like '%200%'


--■ Показати інформацію про студентів із конкретним 
--ім’ям. Наприклад, показати студентів з ім’ям Борис.

select * from Students 
where [fio] like '%1'

--■ Показати інформацію про студентів, в номері яких 
--є три сімки.

select * from Students 
where [phone] like '%777%'


--■ Показати електронні адреси студентів, що починаються з конкретної літери.

select [email] from Students 
where [email] like 't%'


--Завдання 2
--Створіть наступні запити для бази даних з оцінками 
--студентів із попереднього практичного завдання:
--Практичне завдання
--1
--■ Показати максимальну середню оцінку по всіх студентах.
--■ Показати статистику міст. Має відображатися назва 
--міста та кількість студентів з цього міста.
--■ Показати статистику студентів. Має відображатися 
--назва країни та кількість студентів з цієї країни.
--■ Показати кількість студентів з мінімальною середньою 
--оцінкою з математики.
--■ Показати кількість студентів з максимальною середньою оцінкою з математики.
--■ Показати кількість студентів у кожній групі.
--■ Показати середню оцінку групи

--■ Показати мінімальну середню оцінку по всіх студентах.

select min([average_mark]) from Students